week06/thp-s6-lundi/app/controllers/sessions_controller.rb

	def create
		if User.find_by(first_name: params[:first_name], email: params[:email]) != nil
---
SELECT  "users".* FROM "users" WHERE "users"."first_name" = $1 AND "users"."email" = $2 LIMIT $3  [["first_name", "asdf"], ["email", "a@a.a"], ["LIMIT", 1]]