week06/thp-s6-lundi/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
	def index
		if session[:name]
			@all_users = User.all

INSERT INTO "users" ("first_name", "last_name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["first_name", "b"], ["last_name", "a"], ["email", "a@b.a"], ["created_at", "2018-11-05 23:49:46.717244"], ["updated_at", "2018-11-05 23:49:46.717244"]]
---
	def create
		u = User.new
		u.first_name = params[:first_name]
		u.last_name = params[:last_name]
		u.email = params[:email]
		if
			u.save