week05/thp-s5-lundi/app/controllers/welcome_controller.rb

	def user
		@username = params[:username]
		@gossips = Gossip.all.reverse
---
SELECT "gossips".* FROM "gossips"