week08/thp-s8-mardi/app/views/home/index.html.erb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."category_id" = $1  [["category_id", 1]]
---
    <ul>
      <% category.tasks.each do |task|  %>