week05/thp-s5-mardi/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
	def list
		@users = User.all

INSERT INTO "users" ("username", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "asdf"], ["email", "asdf"], ["created_at", "2018-10-30 21:51:21.499948"], ["updated_at", "2018-10-30 21:51:21.499948"]]
---
	def create
		u = User.new
		u.username = params[:username]
		u.email = params[:email]
		u.bio = params[:bio]
		u.save