week05/thp-s5-jeudi/app/controllers/registration_controller.rb

	def create
		session[:name] = params[:name]
		User.create(name: params[:name], email: params[:email], password: params[:password])
---
INSERT INTO "users" ("name", "email", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "test"], ["email", "test@test.test"], ["password", "test"], ["created_at", "2018-11-02 00:24:45.700517"], ["updated_at", "2018-11-02 00:24:45.700517"]]

	def new
		if User.find_by(name: params[:name], password: params[:password]) != nil
			@user_creds = true
			session[:name] = params[:name]
			redirect_to "/"
		end
		@current_user = User.find_by(name: session[:name])
---
SELECT  "users".* FROM "users" WHERE "users"."name" = $1 AND "users"."password" = $2 LIMIT $3  [["name", "Mac"], ["password", "asdf666"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."name" = $1 LIMIT $2  [["name", "Mac"], ["LIMIT", 1]]